giedriuslt/OpenBL602/customer_app/bl602_demo_wifi/bl602_demo_wifi/main.c
    switch (event) {
    case BL_WPS_EVENT_PIN:
        pin = (bl_wps_pin_t *)payload;
        wps_dbg("PIN %s", pin->pin);
        vPortFree(pin);
        break;
    case BL_WPS_EVENT_COMPLETE:
        wps_dbg("completed");
        ap_cred = (bl_wps_ap_credential_t *)payload;
        // ap_cred should always be valid
        wps_dbg("AP SSID %s", ap_cred->ssid);
        wps_dbg("AP passphrase %s", ap_cred->passphrase);
        wps_dbg("connecting...");
        wifi_interface = wifi_mgmr_sta_enable();
        wifi_mgmr_sta_connect(wifi_interface, (char *)ap_cred->ssid, ap_cred->passphrase, NULL,  NULL, 0, 0);
        vPortFree(ap_cred);
        break;
    case BL_WPS_EVENT_TIMEOUT:
        wps_dbg("timed out");
        break;
    default:
        wps_dbg("error occured, event: %d", event);
    }
}

static void cmd_wps_pbc_(char *buf, int len, int argc, char **argv)
{
    wps_type_t type;
    if (!strcmp(argv[0], WPS_PBC_CMD)) {
        type = WPS_TYPE_PBC;
    } else {
        type = WPS_TYPE_PIN;
    }
    const struct bl_wps_config config = {
        .type = type,
        .event_cb = wps_event_callback_,
    };

    bl_wps_err_t ret = bl_wifi_wps_start(&config);
    if (ret != BL_WPS_ERR_OK) {
        wps_dbg("bl_wifi_wps_start failed with code %d", (int)ret);
    }
}

#include <utils_log.h>
static void cmd_pmk(char *buf, int len, int argc, char **argv)
{
int utils_wifi_psk_cal_fast(char *password, char *ssid, int ssid_len, char *output);
int pbkdf2_sha1(const char *passphrase, const char *ssid, size_t ssid_len,
		int iterations, uint8_t *buf, size_t buflen);
    const char *password = "12345678";
    const char *ssid = "testme";
    char output[65];

#if 0
    memset(output, 0, sizeof(output));
    utils_wifi_psk_cal_fast(password, ssid, strlen(ssid), output);
    printf("PMK: %s\r\n", output);
#endif

    memset(output, 0, sizeof(output));
    pbkdf2_sha1(password, ssid, strlen(ssid), 4096, (void *)output, 32);
    log_buf(output, 32);
}

const static struct cli_command cmds_user[] STATIC_CLI_CMD_ATTRIBUTE = {
        { "aws", "aws iot demo", cmd_aws},
        { "pka", "pka iot demo", cmd_pka},
        { "wifi", "wifi", cmd_wifi},
        { "sha", "sha iot demo", cmd_sha},
        { "trng", "trng test", cmd_trng},
        { "aes", "trng test", cmd_aes},
        { "cks", "cks test", cmd_cks},
        { "dma", "dma test", cmd_dma},
        { "exception_load", "exception load test", cmd_exception_load},
        { "exception_l_illegal", "exception load test", cmd_exception_l_illegal},
        { "exception_store", "exception store test", cmd_exception_store},
        { "exception_inst_illegal", "exception illegal instruction", cmd_exception_illegal_ins},
        /*Stack Command*/
        { "stack_wifi", "Wi-Fi Stack", cmd_stack_wifi},
        /*TCP/IP network test*/
        {"http", "http client download test based on socket", http_test_cmd},
        {"httpc", "http client download test based on RAW TCP", cmd_httpc_test},
        {"pmk", "http client download test based on RAW TCP", cmd_pmk},
        {WPS_PBC_CMD, "WPS Push Button demo", cmd_wps_pbc_},
        {WPS_PIN_CMD, "WPS Device PIN demo", cmd_wps_pbc_},
};

static void _cli_init()
{
    /*Put CLI which needs to be init here*/
int codex_debug_cli_init(void);
    codex_debug_cli_init();
    easyflash_cli_init();
    network_netutils_iperf_cli_register();
    network_netutils_tcpserver_cli_register();
    network_netutils_tcpclinet_cli_register();
    network_netutils_netstat_cli_register();
    network_netutils_ping_cli_register();
    sntp_cli_init();
    bl_sys_time_cli_init();
    bl_sys_ota_cli_init();
    blfdt_cli_init();
    wifi_mgmr_cli_init();
    bl_wdt_cli_init();
    bl_gpio_cli_init();
    looprt_test_cli_init();
}

// Helper function to safely read EasyFlash env variables into local buffers immediately
static void get_env_str(const char *key, char *dst, size_t max_len, const char *default_val) {
    const char *val = ef_get_env(key);
    if (val && *val != '\0') {
        strncpy(dst, val, max_len - 1);
        dst[max_len - 1] = '\0';
    } else {
        strncpy(dst, default_val, max_len - 1);
        dst[max_len - 1] = '\0';
    }
}


static void watchdog_task(void *pvParameters) {
    // 1. Retrieve current boot counter from EasyFlash env
    char boot_str[16];
    get_env_str("boot_count", boot_str, sizeof(boot_str), "0");
    int boot_count = atoi(boot_str) + 1;

    snprintf(boot_str, sizeof(boot_str), "%d", boot_count);
    ef_set_env("boot_count", boot_str);

    ef_save_env();

    // 3. Configure hardware watchdog timer for 4096 ms
    bl_wdt_init(4096);

    uint32_t uptime_sec = 0;
    bool reset_done = false;

    while (1) {
        vTaskDelay(pdMS_TO_TICKS(1000));
        uptime_sec++;
		
		// Feed the hardware watchdog timer
        bl_wdt_feed();

        // 4. Reset boot counter to zero after 10 seconds of stable boot
        if (!reset_done && uptime_sec >= 10) {
            ef_set_env("boot_count", "0");
            ef_save_env();
            reset_done = true;
        }
    }
}

void start_watchdog_task(void) {
    // Priority lower than HTTP_Server (tskIDLE_PRIORITY + 1)
    // CPU-bound infinite loops in HTTP thread will starve this task and trigger WDT reset
    xTaskCreate(watchdog_task, "WDT_Task", 1024, NULL, tskIDLE_PRIORITY + 1, NULL);
}

static bool is_wifi_param_valid(const char *ssid, const char *key) {
    if (ssid == NULL || strlen(ssid) == 0) {
        return false;
    }
    if (key == NULL || strlen(key) < 8) {
        return false;
    }
    return true;
}

void app_mac_nat_init_from_env(void)
{
    vTaskDelay(pdMS_TO_TICKS(1000));

    char boot_str[16] = {0};
    char sta_ssid[33] = {0};
    char sta_key[65]  = {0};
    char ap_ssid[33]  = {0};
    char ap_key[65]   = {0};

    // 1. Read EasyFlash keys matching your form fields
    get_env_str("boot_count",   boot_str, sizeof(boot_str), "0");
    get_env_str("UpstreamSSID", sta_ssid, sizeof(sta_ssid), "");
    get_env_str("UpstreamPSK",  sta_key,  sizeof(sta_key),  "");
    get_env_str("DeviceSSID",   ap_ssid,  sizeof(ap_ssid),  "");
    get_env_str("DevicePSK",    ap_key,   sizeof(ap_key),   "");

    int boot_count = atoi(boot_str);
    uint8_t ap_channel = (uint8_t)6;
    if (ap_channel < 1 || ap_channel > 14) {
        ap_channel = 6;
    }

    // 2. Validate both STA and AP configurations
    bool sta_ok = is_wifi_param_valid(sta_ssid, sta_key);
    bool ap_ok  = is_wifi_param_valid(ap_ssid, ap_key);

    // 3. Fallback to recovery mode if boot limit reached or validation fails
    if (boot_count >= 5) {
        printf("[RECOVERY] Boot count (%d) >= 5! Entering Recovery Mode...\r\n", boot_count);
        app_recovery_init(ap_channel);
        return;
    }

    if (!sta_ok || !ap_ok) {
        printf("[RECOVERY] Credential validation failed (Upstream OK: %d, Device OK: %d). Entering Recovery Mode...\r\n", 
               sta_ok, ap_ok);
        app_recovery_init(ap_channel);
        return;
    }

    // 4. Start concurrent AP + STA if credentials pass
    printf("[MAC_NAT] Verified environment variables. Starting AP+STA mode on channel %d...\r\n", ap_channel);
    app_sta_init(sta_ssid, sta_key);
    app_ap_init(ap_ssid, ap_key, ap_channel);
}

static void proc_main_entry(void *pvParameters)
{
    easyflash_init();

    _cli_init();


    aos_register_event_filter(EV_WIFI, event_cb_wifi_event, NULL);
    cmd_stack_wifi(NULL, 0, 0, NULL);
	start_watchdog_task();
	app_mac_nat_init_from_env();
	start_webserver_task();

    vTaskDelete(NULL);
}

static void system_thread_init()
{
    /*nothing here*/
}

/* init adc for tsen*/
#ifdef CONF_ADC_ENABLE_TSEN
static hosal_adc_dev_t adc0;

static void adc_tsen_init()
{
    int ret = -1;

    adc0.port = 0;
    adc0.config.sampling_freq = 300;
    adc0.config.pin = 4;
    adc0.config.mode = 0;

    ret = hosal_adc_init(&adc0);
    if (ret) {
        log_error("adc init error!\r\n");
        return;
    }
}
#endif

void main()
{
    bl_sys_init();

    system_thread_init();

#ifdef CONF_ADC_ENABLE_TSEN
    adc_tsen_init();
#endif

    puts("[OS] Starting proc_hellow_entry task...\r\n");
    // xTaskCreateStatic(proc_hellow_entry, (char*)"hellow", 512, NULL, 15, proc_hellow_stack, &proc_hellow_task);
    puts("[OS] Starting proc_mian_entry task...\r\n");
    xTaskCreate(proc_main_entry, (char*)"main_entry", 1024, NULL, 15, NULL);
    puts("[OS] Starting TCP/IP Stack...\r\n");
    tcpip_init(NULL, NULL);
}
